Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm_tdd.c
#include "modmachine.h"

#if MICROPY_PY_MACHINE_PDM_PCM_TDD

/*******************************************************************************
* Header Files
*******************************************************************************/
#include "cy_pdl.h"
#include "cybsp.h"
#include <stdlib.h>
// #include "app_pdm_pcm.h"
#include "retarget_io_init.h"


#include "extmod/vfs.h"
#include "py/runtime.h"
#include "py/stream.h"
#include "py/ringbuf.h"



#define PDM_PCM_RX_FRAME_SIZE_IN_BYTES     (8)

/*******************************************************************************
* Macros
*******************************************************************************/
/* Number of channels  */
#define NUM_CHANNELS                            (2u)

/* Channel Index */
#define LEFT_CH_INDEX                           (2u)
#define RIGHT_CH_INDEX                          (3u)
#define LEFT_CH_CONFIG                          channel_2_config
#define RIGHT_CH_CONFIG                         channel_3_config

/* PDM PCM interrupt priority */
#define PDM_PCM_ISR_PRIORITY                    (2u)

/* Frame size over which volume is calculated */
#define FRAME_SIZE                              (32768u)

/* PDM PCM hardware FIFO size */
#define HW_FIFO_SIZE                            (64u)
/* Rx FIFO trigger level/threshold configured by user */
#define RX_FIFO_TRIG_LEVEL                      (HW_FIFO_SIZE / 2)
/* Total number of interrupts to get the FRAME_SIZE number of samples*/
#define NUMBER_INTERRUPTS_FOR_FRAME             (FRAME_SIZE / RX_FIFO_TRIG_LEVEL)

/* Noise threshold hysteresis */
#define THRESHOLD_HYSTERESIS                    (3u)
/* Volume ratio for noise and print purposes */
// #define VOLUME_RATIO                            (10*FRAME_SIZE)

/* Gain range for EVK kit PDM mic */
#define PDM_PCM_MIN_GAIN                        (-103.0)
#define PDM_PCM_MAX_GAIN                        (83.0)
#define PDM_MIC_GAIN_VALUE                      (20)

/* Gain to Scale mapping */

#define PDM_PCM_SEL_GAIN_83DB                   (83.0)
#define PDM_PCM_SEL_GAIN_77DB                   (77.0)
#define PDM_PCM_SEL_GAIN_71DB                   (71.0)
#define PDM_PCM_SEL_GAIN_65DB                   (65.0)
#define PDM_PCM_SEL_GAIN_59DB                   (59.0)
#define PDM_PCM_SEL_GAIN_53DB                   (53.0)
#define PDM_PCM_SEL_GAIN_47DB                   (47.0)
#define PDM_PCM_SEL_GAIN_41DB                   (41.0)
#define PDM_PCM_SEL_GAIN_35DB                   (35.0)
#define PDM_PCM_SEL_GAIN_29DB                   (29.0)
#define PDM_PCM_SEL_GAIN_23DB                   (23.0)
#define PDM_PCM_SEL_GAIN_17DB                   (17.0)
#define PDM_PCM_SEL_GAIN_11DB                   (11.0)
#define PDM_PCM_SEL_GAIN_5DB                    (5.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_1DB           (-1.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_7DB           (-7.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_13DB          (-13.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_19DB          (-19.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_25DB          (-25.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_31DB          (-31.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_37DB          (-37.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_43DB          (-43.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_49DB          (-49.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_55DB          (-55.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_61DB          (-61.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_67DB          (-67.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_73DB          (-73.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_79DB          (-79.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_85DB          (-85.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_91DB          (-91.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_97DB          (-97.0)
#define PDM_PCM_SEL_GAIN_NEGATIVE_103DB         (-103.0)

void app_pdm_pcm_init(void);
void pdm_interrupt_handler(void);
void app_pdm_pcm_activate(void);
void app_pdm_pcm_deactivate(void);
cy_en_pdm_pcm_gain_sel_t convert_db_to_pdm_scale(float db);
void set_pdm_pcm_gain(cy_en_pdm_pcm_gain_sel_t gain);


typedef struct _ring_buf_t {
    uint8_t *buffer;
    size_t head;
    size_t tail;
    size_t size;
} ring_buf_t;

typedef struct _non_blocking_descriptor_t {
    mp_buffer_info_t appbuf;
    uint32_t index;
    bool copy_in_progress;
} non_blocking_descriptor_t;

void ringbuf_init(ring_buf_t *rbuf, size_t size);
bool ringbuf_push(ring_buf_t *rbuf, uint8_t data);
bool ringbuf_pop(ring_buf_t *rbuf, uint8_t *data);
size_t ringbuf_available_data(ring_buf_t *rbuf);
size_t ringbuf_available_space(ring_buf_t *rbuf);

void ringbuf_init(ring_buf_t *rbuf, size_t size) {
    rbuf->buffer = m_new(uint8_t, size);
    memset(rbuf->buffer, 0, size);
    rbuf->size = size;
    rbuf->head = 0;
    rbuf->tail = 0;
}

bool ringbuf_push(ring_buf_t *rbuf, uint8_t data) {
    size_t next_tail = (rbuf->tail + 1) % rbuf->size;
    if (next_tail != rbuf->head) {
        rbuf->buffer[rbuf->tail] = data;
        rbuf->tail = next_tail;
        return true;
    }
    // full
    return false;
}

bool ringbuf_pop(ring_buf_t *rbuf, uint8_t *data) {
    if (rbuf->head == rbuf->tail) {
        // empty
        return false;
    }

    *data = rbuf->buffer[rbuf->head];
    rbuf->head = (rbuf->head + 1) % rbuf->size;
    return true;
}

size_t ringbuf_available_data(ring_buf_t *rbuf) {
    return (rbuf->tail - rbuf->head + rbuf->size) % rbuf->size;
}

size_t ringbuf_available_space(ring_buf_t *rbuf) {
    return rbuf->size - ringbuf_available_data(rbuf) - 1;
}


/* Array containing the recorded data */
uint8_t audio_buffer0[NUM_CHANNELS * FRAME_SIZE * 2];
// ringbuf_t ring_buffer;
// int16_t buf_array[NUM_CHANNELS * FRAME_SIZE * 2]; // 2 bytes per sample for 16-bit audio
uint32_t rxbuf_len = NUM_CHANNELS * FRAME_SIZE * 2;
ring_buf_t ring_buffer;
// ringbuf_t ring_buffer = {(uint8_t *)audio_buffer0, NUM_CHANNELS * FRAME_SIZE * 2, 0, 0}; // Using audio_buffer0 as the storage for the ring buffer
ring_buf_t ring_buffer = {(uint8_t *)audio_buffer0, NUM_CHANNELS *FRAME_SIZE * 2, 0, 0};  // Initialize with NULL buffer and zero size, will be set in app_pdm_pcm_init

/* PDM PCM interrupt configuration parameters */
const cy_stc_sysint_t PDM_IRQ_cfg =
{
    .intrSrc = (IRQn_Type)CYBSP_PDM_CHANNEL_3_IRQ,
    .intrPriority = PDM_PCM_ISR_PRIORITY
};

