Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm_tdd.c
/* PDM PCM flag indicating PCM data is available to process */
volatile bool pdm_pcm_flag = false;

/* Volume variables */
// uint32_t volume = 0;
// uint32_t noise_threshold = THRESHOLD_HYSTERESIS;

/* Counts number of half FIFO frames captured */
uint32_t static frame_counter = 0;

#include "mphalport.h"

extern const machine_pin_obj_t pin_P10_7_obj;
static void pdm_pcm_rx_fifo_buffer_init(void);

void app_pdm_pcm_init(void) {
    cy_en_pdm_pcm_gain_sel_t gain_scale = CY_PDM_PCM_SEL_GAIN_NEGATIVE_37DB;

    // ringbuf_alloc(&ring_buffer, rxbuf_len);
    // ringbuf_init(&ring_buffer, rxbuf_len);

    /* Initialize PDM PCM block */
    if (CY_PDM_PCM_SUCCESS != Cy_PDM_PCM_Init(PDM0, &CYBSP_PDM_config)) {
        CY_ASSERT(0);
    }

    /* Initialize PDM PCM channel 2 -Left and 3 -Right */
    Cy_PDM_PCM_Channel_Enable(PDM0, LEFT_CH_INDEX);
    Cy_PDM_PCM_Channel_Enable(PDM0, RIGHT_CH_INDEX);

    Cy_PDM_PCM_Channel_Init(PDM0, &LEFT_CH_CONFIG, (uint8_t)LEFT_CH_INDEX);
    Cy_PDM_PCM_Channel_Init(PDM0, &RIGHT_CH_CONFIG, (uint8_t)RIGHT_CH_INDEX);

    /* Set the gain for both left and right channels. */

    gain_scale = convert_db_to_pdm_scale((double)PDM_MIC_GAIN_VALUE);
    set_pdm_pcm_gain(gain_scale);

    /* As interrupt is registered for right channel, clear and set masks for it. */
    Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_MASK);
    Cy_PDM_PCM_Channel_SetInterruptMask(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_MASK);

    /* Register the IRQ handler */
    if (CY_SYSINT_SUCCESS != Cy_SysInt_Init(&PDM_IRQ_cfg, &pdm_interrupt_handler)) {
        printf("PDM PCM Initialization has failed! \r\n");
        CY_ASSERT(0);
    }
    NVIC_ClearPendingIRQ(PDM_IRQ_cfg.intrSrc);
    NVIC_EnableIRQ(PDM_IRQ_cfg.intrSrc);

    mp_hal_pin_output(&pin_P10_7_obj);
    mp_hal_pin_write(&pin_P10_7_obj, 0); // Set pin high to indicate ready state

    pdm_pcm_rx_fifo_buffer_init();
}

/*******************************************************************************
* Function Name: app_pdm_pcm_activate
********************************************************************************
* Summary: This function activates the left and right channel.
*
* Parameters:
*  none
*
* Return :
*  none
*
*******************************************************************************/
void app_pdm_pcm_activate(void) {
    /* Activate recording from channel after init */
    Cy_PDM_PCM_Activate_Channel(PDM0, LEFT_CH_INDEX);
    Cy_PDM_PCM_Activate_Channel(PDM0, RIGHT_CH_INDEX);
}

static bool audio_file_saved = false;
void save_audio_to_file() {
    // while (!pdm_pcm_flag) {
    //     // Wait until the PDM PCM data is ready
    // }

    while (ringbuf_available_space(&ring_buffer) > 8) {

    }
    mp_hal_pin_write(&pin_P10_7_obj, 1);

    // for(uint32_t i=0; i < rxbuf_len/2; i++)
    // {
    //     uint8_t msb = audio_buffer0[i] >> 8; // Get the most significant byte
    //     uint8_t lsb = audio_buffer0[i] & 0xFF; //Get the least significant byte
    //     ringbuf_put(&ring_buffer, msb);
    //     ringbuf_put(&ring_buffer, lsb);
    // }

    // Hardcoded file creation and save
    mp_obj_t file_args[2];
    file_args[0] = mp_obj_new_str("audio.raw", 14);  // filename
    file_args[1] = MP_OBJ_NEW_QSTR(MP_QSTR_wb);      // mode 'wb'

    mp_obj_t file = mp_vfs_open(2, file_args, (mp_map_t *)&mp_const_empty_map);

    const mp_stream_p_t *stream = mp_get_stream(file);

    // Write in chunks of 1024 bytes
    size_t total_bytes = FRAME_SIZE * NUM_CHANNELS;
    size_t chunk_size = 1024;
    // uint8_t *data_ptr = (uint8_t *)audio_buffer0;
    uint8_t *data_ptr = ring_buffer.buffer;

    int errcode = 0;
    for (size_t i = 0; i < total_bytes && errcode == 0; i += chunk_size) {
        size_t bytes_to_write = (i + chunk_size > total_bytes) ? (total_bytes - i) : chunk_size;
        stream->write(file, data_ptr + i, bytes_to_write, &errcode);
    }

    // int errcode = 0;
    // for (size_t i = 0; i < total_bytes && errcode == 0; i++) {
    //     if (ringbuf_available_data(&ring_buffer) == 0) {
    //         // No more data in ring buffer, break out of loop
    //         break;
    //     }
    //     uint8_t data;
    //     ringbuf_pop(&ring_buffer, &data);
    //     stream->write(file, &data, 1, &errcode);
    // }

    // Close file
    mp_stream_close(file);

    audio_file_saved = true;
    // return mp_const_none;
}

/*******************************************************************************
* Function Name: app_pdm_pcm_deactivate
********************************************************************************
* Summary: This function activates the left and right channel.
*
* Parameters:
*  none
*
* Return :
*  none
*
*******************************************************************************/
void app_pdm_pcm_deactivate(void) {
    Cy_PDM_PCM_DeActivate_Channel(PDM0, LEFT_CH_INDEX);
    Cy_PDM_PCM_DeActivate_Channel(PDM0, RIGHT_CH_INDEX);
}


cy_en_pdm_pcm_gain_sel_t convert_db_to_pdm_scale(float db) {
    if (db <= PDM_PCM_MIN_GAIN) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_103DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_103DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_97DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_97DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_97DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_91DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_91DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_91DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_85DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_85DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_85DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_79DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_79DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_79DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_73DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_73DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_73DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_67DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_67DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_67DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_61DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_61DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_61DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_55DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_55DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_55DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_49DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_49DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_49DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_43DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_43DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_43DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_37DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_37DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_37DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_31DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_31DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_31DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_25DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_25DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_25DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_19DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_19DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_19DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_13DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_13DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_13DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_7DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_7DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_7DB && db <= PDM_PCM_SEL_GAIN_NEGATIVE_1DB) {
        return CY_PDM_PCM_SEL_GAIN_NEGATIVE_1DB;
    } else if (db > PDM_PCM_SEL_GAIN_NEGATIVE_1DB && db <= PDM_PCM_SEL_GAIN_5DB) {
        return CY_PDM_PCM_SEL_GAIN_5DB;
    } else if (db > PDM_PCM_SEL_GAIN_5DB && db <= PDM_PCM_SEL_GAIN_11DB) {
        return CY_PDM_PCM_SEL_GAIN_11DB;
    } else if (db > PDM_PCM_SEL_GAIN_11DB && db <= PDM_PCM_SEL_GAIN_17DB) {
        return CY_PDM_PCM_SEL_GAIN_17DB;
    } else if (db > PDM_PCM_SEL_GAIN_17DB && db <= PDM_PCM_SEL_GAIN_23DB) {
        return CY_PDM_PCM_SEL_GAIN_23DB;
    } else if (db > PDM_PCM_SEL_GAIN_23DB && db <= PDM_PCM_SEL_GAIN_29DB) {
        return CY_PDM_PCM_SEL_GAIN_29DB;
    } else if (db > PDM_PCM_SEL_GAIN_29DB && db <= PDM_PCM_SEL_GAIN_35DB) {
        return CY_PDM_PCM_SEL_GAIN_35DB;
    } else if (db > PDM_PCM_SEL_GAIN_35DB && db <= PDM_PCM_SEL_GAIN_41DB) {
        return CY_PDM_PCM_SEL_GAIN_41DB;
    } else if (db > PDM_PCM_SEL_GAIN_41DB && db <= PDM_PCM_SEL_GAIN_47DB) {
        return CY_PDM_PCM_SEL_GAIN_47DB;
    } else if (db > PDM_PCM_SEL_GAIN_47DB && db <= PDM_PCM_SEL_GAIN_53DB) {
        return CY_PDM_PCM_SEL_GAIN_53DB;
    } else if (db > PDM_PCM_SEL_GAIN_53DB && db <= PDM_PCM_SEL_GAIN_59DB) {
        return CY_PDM_PCM_SEL_GAIN_59DB;
    } else if (db > PDM_PCM_SEL_GAIN_59DB && db <= PDM_PCM_SEL_GAIN_65DB) {
        return CY_PDM_PCM_SEL_GAIN_65DB;
    } else if (db > PDM_PCM_SEL_GAIN_65DB && db <= PDM_PCM_SEL_GAIN_71DB) {
        return CY_PDM_PCM_SEL_GAIN_71DB;
    } else if (db > PDM_PCM_SEL_GAIN_71DB && db <= PDM_PCM_SEL_GAIN_77DB) {
        return CY_PDM_PCM_SEL_GAIN_77DB;
    } else if (db > PDM_PCM_SEL_GAIN_77DB && db <= PDM_PCM_SEL_GAIN_83DB) {
        return CY_PDM_PCM_SEL_GAIN_83DB;
    } else if (db > PDM_PCM_MAX_GAIN) {
        return CY_PDM_PCM_SEL_GAIN_83DB;
    } else {
        return (cy_en_pdm_pcm_gain_sel_t)PDM_MIC_GAIN_VALUE;
    }

