Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm_tdd.c
}
/*******************************************************************************
 * Function Name: set_pdm_pcm_gain
 ********************************************************************************
 *
 * Set PDM scale value for gain.
 *
 *******************************************************************************/
void set_pdm_pcm_gain(cy_en_pdm_pcm_gain_sel_t gain) {

    Cy_PDM_PCM_SetGain(PDM0, RIGHT_CH_INDEX, gain);
    Cy_PDM_PCM_SetGain(PDM0, LEFT_CH_INDEX, gain);

}

/* note: Actually for 8 to 32 is supported. */
typedef enum {
    BITS_16 = 16,
    BITS_32 = 32
} pdm_pcm_word_length_t;

typedef enum {
    MONO_LEFT,
    MONO_RIGHT,
    STEREO
} format_t;

static const int8_t pdm_pcm_frame_map[4][PDM_PCM_RX_FRAME_SIZE_IN_BYTES] = {
    { 0,  1, -1, -1, -1, -1, -1, -1 },  // Mono, 16-bits
    { 0,  1,  2,  3, -1, -1, -1, -1 },  // Mono, 32-bits
    { 0,  1, -1, -1,  2,  3, -1, -1 },  // Stereo, 16-bits
    { 0,  1,  2,  3,  4,  5,  6,  7 },  // Stereo, 32-bits
};

int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if ((format == MONO_LEFT) | (format == MONO_RIGHT)) {
        if (bits == 16) {
            return 0;
        }
    } else { // STEREO
        if (bits == 16) {
            return 2;
        }
    }
    return -1;
}


/**
 * Number of FIFO frames that will be stored
 * in each half of the ping-pong buffer.
 */
#define NUM_OF_RX_HW_FIFO_FRAMES_IN_RX_BUFFER         16
#define NUM_OF_RX_HW_FIFO_FRAMES_IN_HALF_RX_BUFFER    (NUM_OF_RX_HW_FIFO_FRAMES_IN_RX_BUFFER / 2)

/**
 * The PDM PCM peripheral has hardware FIFO capable
 * of up to 64 samples.
 * The IRQ trigger level is set to half of the FIFO size.
 * That way we can process the samples when the FIFO is
 * half full, ensuring that we read the samples before the
 * FIFO is full and we lose data.
 * Each half size FIFO read will compose a frame that will
 * be added to the ping-pong buffer.
 * As each sample is considered to be 8 bytes,
 * a frame match the actual size of the hardware FIFO for
 * a mono channel, or 2 halves FIFO for stereo.
 * In case of
 */
#define MAX_SAMPLES_RX_HW_FIFO                 64
#define NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME     32
#define NUM_OF_WORDS_IN_RX_HW_FIFO_FRAME       (NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME * 2)
#define RX_HW_FIFO_IRQ_TRIGGER_LEVEL           (NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME)

/**
 * A ping-pong buffer implementation will store the samples read
 * from the PDM PCM hardware FIFO.
 *
 * Each sample will contain up to 8 bytes of data, being able
 * to store up to 32-bit stereo samples.
 * As the buffer is a uint32_t array, each sample will take
 * 2 positions in the buffer.
 * In case of mono audio, the odd positions will be empty.
 *
 * The buffer is be split into two halves.
 * The active half will be the one used in the IRQ handler to
 * store the incoming samples from the FIFO.
 * The processing half will be used to copy the samples
 * into the ring buffer.
 *
 * The ring buffer will be used to transfer the data stream
 * into the application provided buffer.
 */
#define SIZEOF_RX_BUFFER_IN_SAMPLES            (NUM_OF_RX_HW_FIFO_FRAMES_IN_RX_BUFFER * NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME)
#define SIZEOF_RX_BUFFER_IN_WORDS              (SIZEOF_RX_BUFFER_IN_SAMPLES * 2)
#define SIZEOF_HALF_RX_BUFFER_IN_SAMPLES       (SIZEOF_RX_BUFFER_IN_SAMPLES / 2)
#define SIZEOF_HALF_RX_BUFFER_IN_WORDS         (SIZEOF_HALF_RX_BUFFER_IN_SAMPLES * 2)

#define SIZEOF_PDM_PCM_SAMPLE_IN_BYTES          8

static uint32_t rx_fifo_buffer[SIZEOF_RX_BUFFER_IN_WORDS];
uint32_t *active_half_rx_fifo_buf_ptr;
uint32_t *processing_half_rx_fifo_buf_ptr;

uint8_t rx_hw_fifo_frame_count;

pdm_pcm_word_length_t bits = BITS_16;
format_t format = STEREO;

static void pdm_pcm_rx_fifo_buffer_init(void) {
    memset(rx_fifo_buffer, 0, sizeof(rx_fifo_buffer));
    active_half_rx_fifo_buf_ptr = rx_fifo_buffer;
    processing_half_rx_fifo_buf_ptr = &rx_fifo_buffer[SIZEOF_HALF_RX_BUFFER_IN_WORDS];
    rx_hw_fifo_frame_count = 0;
}

static void _pdm_pcm_read_half_rx_fifo(uint32_t *half_rx_fifo_buf_ptr) {
    for (uint32_t index = 0; index < RX_HW_FIFO_IRQ_TRIGGER_LEVEL; index++)
    {
        uint32_t data = (uint32_t)Cy_PDM_PCM_Channel_ReadFifo(PDM0, LEFT_CH_INDEX);
        /**
         * The mono/left channel uses the even indexes.
         */
        half_rx_fifo_buf_ptr[index * 2] = data;
        if (format == STEREO) {
            data = Cy_PDM_PCM_Channel_ReadFifo(PDM0, RIGHT_CH_INDEX);
            /**
             * The stereo/right channel uses the odd indexes.
             */
            half_rx_fifo_buf_ptr[index * 2 + 1] = data;
        }
    }
}


static inline bool pdm_pcm_is_half_rx_buffer_full(void) {
    return rx_hw_fifo_frame_count == 0;
}

static void _pdm_pcm_update_rx_hw_fifo_frame_counter(void) {
    rx_hw_fifo_frame_count++;
    if (rx_hw_fifo_frame_count == NUM_OF_RX_HW_FIFO_FRAMES_IN_HALF_RX_BUFFER) {
        rx_hw_fifo_frame_count = 0;
    }
}

static void _pdm_pcm_swap_half_rx_buffer(void) {
    if (pdm_pcm_is_half_rx_buffer_full()) {
        uint32_t *temp = active_half_rx_fifo_buf_ptr;
        active_half_rx_fifo_buf_ptr = processing_half_rx_fifo_buf_ptr;
        processing_half_rx_fifo_buf_ptr = temp;
    }
}

static inline uint32_t *_pdm_pcm_get_next_rx_buffer_segment_to_fill(void) {
    return &active_half_rx_fifo_buf_ptr[NUM_OF_WORDS_IN_RX_HW_FIFO_FRAME * rx_hw_fifo_frame_count];
}

static void pdm_pcm_read_rx_buffer(void) {
    uint32_t *rx_fifo_buffer_segment_ptr = _pdm_pcm_get_next_rx_buffer_segment_to_fill();
    _pdm_pcm_read_half_rx_fifo(rx_fifo_buffer_segment_ptr);
    _pdm_pcm_update_rx_hw_fifo_frame_counter();
    _pdm_pcm_swap_half_rx_buffer();
}

static void pdm_pcm_copy_half_rx_buffer_to_ringbuf() {
    uint8_t sample_size_in_bytes = (bits == BITS_16 ? 2 : 4) * (format == STEREO ? 2: 1);
    uint8_t *rx_buf_sample_ptr = (uint8_t *)processing_half_rx_fifo_buf_ptr;
    uint32_t num_bytes_needed_from_ringbuf = NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME * sample_size_in_bytes;

