Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm_tdd.c
    // when space exists, copy samples into ring buffer
    if (ringbuf_available_space(&ring_buffer) >= num_bytes_needed_from_ringbuf) {
        uint8_t f_index = get_frame_mapping_index(bits, format);
        uint32_t i = 0;
        while (i < (SIZEOF_HALF_RX_BUFFER_IN_SAMPLES * SIZEOF_PDM_PCM_SAMPLE_IN_BYTES)) {
            for (uint8_t j = 0; j < SIZEOF_PDM_PCM_SAMPLE_IN_BYTES; j++) {
                int8_t r_to_a_mapping = pdm_pcm_frame_map[f_index][j];
                if (r_to_a_mapping != -1) {
                    ringbuf_push(&ring_buffer, rx_buf_sample_ptr[i]);
                }
                i++;
                // For now we are not going to add the -1 value to the ring buffer,
                // we add this later
                /*
                } else { // r_a_mapping == -1
                    ringbuf_push(&ring_buffer, -1);
                }
                */
            }
        }
    }
}

void pdm_disable() {
    // Toggle the LED0 to indicate that it is full
    mp_hal_pin_write(&pin_P10_7_obj, 1);

    pdm_pcm_flag = true;
    frame_counter = 0;

    app_pdm_pcm_deactivate();
    NVIC_ClearPendingIRQ(PDM_IRQ_cfg.intrSrc);
    NVIC_DisableIRQ(PDM_IRQ_cfg.intrSrc);
}

void ready_to_save() {
    mp_hal_pin_write(&pin_P10_7_obj, 1);
    pdm_pcm_flag = true;
}

void pdm_interrupt_handler(void) {
    volatile uint32_t intr_status = Cy_PDM_PCM_Channel_GetInterruptStatusMasked(PDM0, RIGHT_CH_INDEX);
    // static bool ringbuf_full = false;
    // if (!ringbuf_full) {
    if (CY_PDM_PCM_INTR_RX_TRIGGER & intr_status) {
        pdm_pcm_read_rx_buffer();
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_RX_TRIGGER);
        if (pdm_pcm_is_half_rx_buffer_full()) {
            pdm_pcm_copy_half_rx_buffer_to_ringbuf();
        }
    }
    // if (ringbuf_available_space(&ring_buffer) < (SIZEOF_PDM_PCM_SAMPLE_IN_BYTES)) {
    //     // ringbuf_full = true;
    //     ready_to_save();
    // }
    // } else {
    //     pdm_disable();
    // }
    if ((CY_PDM_PCM_INTR_RX_FIR_OVERFLOW | CY_PDM_PCM_INTR_RX_OVERFLOW | CY_PDM_PCM_INTR_RX_IF_OVERFLOW |
         CY_PDM_PCM_INTR_RX_UNDERFLOW) & intr_status) {
        Cy_PDM_PCM_Channel_ClearInterrupt(PDM0, RIGHT_CH_INDEX, CY_PDM_PCM_INTR_MASK);
    }
}

// ------------------------------------------------------------------------------------------------

#include "py/stream.h"
#include "py/runtime.h"

typedef struct _machine_pdm_pcm_obj_t {
    mp_obj_base_t base;
} machine_pdm_pcm_obj_t;

machine_pdm_pcm_obj_t *pdm_pcm_obj;

static void machine_pdm_pcm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    /* TODO: Add implementation*/
}

// PDM_PCM(...) Constructor
static mp_obj_t machine_pdm_pcm_make_new(const mp_obj_type_t *type, size_t n_pos_args, size_t n_kw_args, const mp_obj_t *args) {
    /* TODO: Add implementation*/
    machine_pdm_pcm_obj_t *self = NULL;

    self = mp_obj_malloc(machine_pdm_pcm_obj_t, &machine_pdm_pcm_type);
    pdm_pcm_obj = self;

    return MP_OBJ_FROM_PTR(self);
}

static mp_obj_t machine_pdm_pcm_init(mp_obj_t self_in) {
    /* TODO: Add implementation*/

    app_pdm_pcm_init();
    app_pdm_pcm_activate();
    save_audio_to_file();

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_init_obj, machine_pdm_pcm_init);

static mp_obj_t machine_pdm_pcm_is_ready(mp_obj_t self_in) {
    /* TODO: Add implementation*/

    if (audio_file_saved) {
        return mp_const_true;
    } else {
        return mp_const_false;
    }

    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(machine_pdm_pcm_is_ready_obj, machine_pdm_pcm_is_ready);

static mp_uint_t machine_pdm_pcm_stream_read(mp_obj_t self_in, void *buf_in, mp_uint_t size, int *errcode) {
    /* TODO: Add implementation*/

    mp_buffer_info_t appbuf;
    appbuf.buf = (void *)buf_in;

    // for (size_t i = 0; i < size; i++) {
    //     ((uint8_t *)appbuf.buf)[i] = (uint8_t)(i & 0xFF); // Fill the buffer with dummy data for testing
    // }

    // static bool first_read = true;
    // if (first_read) {
    //     while (!pdm_pcm_flag) {
    //         // Wait until the PDM PCM data is ready
    //     }
    //     mp_printf(&mp_plat_print, ".");
    //     first_read = false;
    // }

    // static uint32_t bytes_left_to_copy = FRAME_SIZE * NUM_CHANNELS;
    // static uint32_t copy_index = 0;
    // if (size > bytes_left_to_copy) {
    //     size = bytes_left_to_copy; // Adjust size to copy only the remaining data
    // }
    // appbuf.len = size;

    // // if (pdm_pcm_flag) {
    // for (size_t i = 0; i < size; i++) {
    //     ((uint8_t *)appbuf.buf)[i] = audio_buffer0[copy_index++]; // Fill the buffer with recorded data
    // }
    // // }
    // bytes_left_to_copy -= size;

    // return size;


    uint32_t available_bytes = ringbuf_available_data(&ring_buffer);
    if (available_bytes == 0) {
        return 0;
    }
    if (size > available_bytes) {
        size = available_bytes; // Adjust size to copy only the available data
    }
    appbuf.len = size;

    size_t i;
    for (i = 0; i < size; i++) {
        uint8_t data;
        if (ringbuf_pop(&ring_buffer, &data)) {
            ((uint8_t *)appbuf.buf)[i] = data; // Fill the buffer with recorded data
        } else {
            break;
        }
    }
    appbuf.len = i;

    return appbuf.len;
}

static const mp_stream_p_t pdm_pcm_stream_p = {
    .read = machine_pdm_pcm_stream_read,
    .is_text = false,
};

static const mp_rom_map_elem_t machine_pdm_pcm_locals_dict_table[] = {
    // Methods
    { MP_ROM_QSTR(MP_QSTR_init),            MP_ROM_PTR(&machine_pdm_pcm_init_obj) },

    { MP_ROM_QSTR(MP_QSTR_isready),         MP_ROM_PTR(&machine_pdm_pcm_is_ready_obj) },

    { MP_ROM_QSTR(MP_QSTR_readinto),        MP_ROM_PTR(&mp_stream_readinto_obj) },
};
MP_DEFINE_CONST_DICT(machine_pdm_pcm_locals_dict, machine_pdm_pcm_locals_dict_table);

MP_DEFINE_CONST_OBJ_TYPE(
    machine_pdm_pcm_type,
    MP_QSTR_PDM_PCM,
    MP_TYPE_FLAG_ITER_IS_STREAM,
    make_new, machine_pdm_pcm_make_new,
    print, machine_pdm_pcm_print,
    protocol, &pdm_pcm_stream_p,
    locals_dict, &machine_pdm_pcm_locals_dict
    );

#endif // MICROPY_PY_MACHINE_PDM_PCM_TDD
